var tl_options = {
	optimal_tick_width: 100,
	marker_padding: 5,
	marker_width_min: 250,
	marker_height_min: 30,
	slide_padding_lr: 150,
	scale_factor: 2,
	initial_zoom:1,
	timenav_height_percentage: 35,
	language: 'ru'
}

var timeline_json = {
	"events": [
		{
			"start_date": {
				"year": "1930",
				"month": "12",
				"day": "10"
			},
			"text": {
				"headline": "Образование Тазовского района",
				"text": "<p>10 декабря 1930 года в составе Ямальского (Ненецкого) национального округа образован Тазовский район с центром в селе Хальмер-Седэ (с 1949 года – село Тазовское, с 1964 – поселок Тазовский). В этом же году в райцентре появились собственная школа-интернат, средняя школа и больница.</p>"
			},
			"media": {
				"url": "timeline/img/tzv-1.jpg",
				"credit": "Архив МВК им. И.С. Шемановского"
			}
		},
		{
			"start_date": {
				"year": "1930",
				"month": "12",
				"day": "11"
			},
			"display_date": "1930",
			"text": {
				"headline": "Cоздан Тазовский рыбопромысловый участок",
				"text": "<p>В 1930 году создан Тазовский рыбопромысловый участок в составе Обского рыбопромышленного треста, впоследствии – Тазовский рыбозавод.</p>"
			},
			"media": {
				"url": "timeline/img/tzv-2.jpg",
				"credit": "Архив МВК им. И.С. Шемановского"
			}
		},
		{
			"start_date": {
				"year": "1931",
				"month": "7"
			},
			"display_date": "Июль 1931",
			"text": {
				"headline": "Строителство будущего административного центра Тазовского района",
				"text": "<p>В июле 1931 года в селе Хальмер-Седэ высадился десант строителей будущего административного центра Тазовского района. Уже к сентябрю закончено формирование райоргбюро, развернута подготовка к проведению избирательной кампании национальных Советов. На фото запечатлены члены первого Тазовского исполкома.</p>"
			},
			"media": {
				"url": "timeline/img/tzv-3.jpg",
				"credit": "Отдел по делам архивов Администрации Тазовского района"
			}
		},
		{
			"start_date": {
				"year": "1933",
				"month": "7"
			},
			"display_date": "Июль 1933",
			"text": {
				"headline": "Основан Тазовский речной порт",
				"text": "<p>В июле 1933 года в Хальмер-Седэ организована Нижняя Зимовка, позже преобразованная в Тазовский речной порт Иртышского речного пароходства.</p>"
			},
			"media": {
				"url": "timeline/img/tzv-4.jpg",
				"credit": "Архив МВК им. И.С. Шемановского"
			}
		},
		{
			"start_date": {
				"year": "1935",
				"month": "1"
			},
			"display_date": "1935",
			"text": {
				"headline": "Создании радиоузла",
				"text": "<p>Принято решение о создании радиоузла в Тазовском районе.</p>"
			}
		},
		{
			"start_date": {
				"year": "1935",
				"month": "2"
			},
			"display_date": "1935",
			"text": {
				"headline": "Создана Тазовская культбаза",
				"text": "<p>Создана Тазовская культбаза в селе Хальмер-Седэ, зона деятельности которой простиралась на бассейн реки Таз до границы с Красноярским краем, на полуостров Малый Ямал и Гыданскую тундру. Культбазы служили опорными хозяйственными и культурными центрами.</p>"
			},
			"media": {
				"url": "timeline/img/tzv-5.jpg",
				"credit": "Архив МВК им. И.С. Шемановского"
			}
		},
		{
			"start_date": {
				"year": "1935",
				"month": "9"
			},
			"display_date": "1935",
			"text": {
				"headline": "В Тазовском районе работают две школы",
				"text": "<p>В Тазовском районе работают две школы, обе в Хальмер-Седэ: школа-интернат на 44 учащихся 1-4-х классов и неполная средняя школа, в которой учатся в 1-7-х классах 97 детей.</p>"
			},
			"media": {
				"url": "timeline/img/tzv-6.jpg",
				"credit": "Архив МВК им. И.С. Шемановского"
			}
		},
		{
			"start_date": {
				"year": "1935",
				"month": "5"
			},
			"display_date": "1935",
			"text": {
				"headline": "Организованы колхозы",
				"text": "<p>Организованы колхозы «Красный Север», колхоз им. Ленина в Хальмер-Седэ, «Дороги Ленина» и «Красная Москва» – в Находке.</p>"
			},
			"media": {
				"url": "timeline/img/tzv-7.jpg",
				"credit": "Архив МВК им. И.С. Шемановского"
			}
		},
		{
			"start_date": {
				"year": "1940",
				"month": "1",
				"day": "3"
			},
			"text": {
				"headline": "Вышел первый номер районной газеты «Нярьяна Вы»",
				"text": "<p>3 января 1940 года вышел первый номер районной газеты «Нярьяна Вы» («Красная тундра»). Сейчас газета известна жителям района под названием «Советское Заполярье». Первым ее редактором был Никифор Кузнецов.</p>"
			},
			"media": {
				"url": "timeline/img/tzv-8.jpg",
				"credit": "Советское Заполярье"
			}
		},
		{
			"start_date": {
				"year": "1941",
				"month": "1"
			},
			"display_date": "Январь 1941",
			"text": {
				"headline": "Создана Тазовская контора почтовой связи",
				"text": "<p>В январе 1941 года создана Тазовская контора почтовой связи. Организация внутренней почтовой связи со всеми факториями и колхозами началась еще в 1940 году, тогда же была проведена первая подписная кампания.</p>"
			}
		},
		{
			"start_date": {
				"year": "1941",
				"month": "6"
			},
			"display_date": "Июнь 1941",
			"text": {
				"headline": "Начало Великой Отечественной войны",
				"text": "<p>23 июня новость о начале Великой Отечественной войны пришла в Хальмер-Седэ, почти сразу же была объявлена мобилизация. Всего за четыре военных года на фронт ушло более 500 жителей района.</p>"
			}
		},
		{
			"start_date": {
				"year": "1942"
			},
			"text": {
				"headline": "Cтроительство Северного рыбозавода",
				"text": "<p>В 1942 году в Антипаюте началось строительство Северного рыбозавода, в 1943 году Тазовский рыбозавод начал обустройство консервного цеха. В годы войны добыча и заготовка рыбы легла на плечи женщин, детей и стариков.</p>"
			},
			"media": {
				"url": "timeline/img/tzv-9.jpg",
				"credit": "Отдел по делам архивов Администрации Тазовского района"
			}
		},
		{
			"start_date": {
				"year": "1943"
			},
			"text": {
				"headline": "Открыто воздушное сообщение с Салехардом",
				"text": "<p>В 1943 году наладили регулярное воздушное сообщение с Салехардом. Зимой почту, пассажиров и важные грузы в район доставляли самолеты Г-1 и У-2, летом – летающие лодки Ш-1 и МБР-2.</p>"
			},
			"media": {
				"url": "timeline/img/tzv-10.jpg",
				"credit": "Архив МВК им. И.С. Шемановского"
			}
		},
		{
			"start_date": {
				"year": "1944",
				"month": "9",
				"day": "20"
			},
			"text": {
				"headline": "Появление немецкой субмарины",
				"text": "<p>20 сентября 1944 года поблизости от Хальмер-Вонга гыданские рыбаки заметили немецкую субмарину, экипаж которой пытался найти удобное место для высадки на берег, чтобы пополнить запасы. Но немцам это не удалось – у Хальмер-Вонга оказалось слишком мелко.</p>"
			}
		},
		{
			"start_date": {
				"year": "1945",
				"month": "8",
				"day": "1"
			},
			"text": {
				"headline": "Начал работу районный отдел культурно-просветительной работы",
				"text": "<p>1 августа 1945 года начал работу районный отдел культурно-просветительной работы при райисполкоме. В настоящее время – это централизованная сеть культурно-досуговых учреждений Тазовского района.</p>"
			},
			"media": {
				"url": "timeline/img/tzv-11.jpg",
				"credit": "Отдел по делам архивов Администрации Тазовского района"
			}
		},
		{
			"start_date": {
				"year": "1945",
				"month": "6"
			},
			"display_date": "1945",
			"text": {
				"headline": "Образован Тазовский райпромкомбинат",
				"text": "<p>Образован Тазовский райпромкомбинат, в котором действовали ремонтно-пошивочный, сапожный, парикмахерский, столярный, кирпичный и известковый цеха.</p>"
			}
		},
		{
			"start_date": {
				"year": "1949"
			},
			"text": {
				"headline": "Современное название",
				"text": "<p>В этом году поселок Тазовский получил свое современное название, а с 1964 года – статус рабочего поселка.</p>"
			},
			"media": {
				"url": "timeline/img/tzv-12.jpg",
				"credit": "Архив МВК им. И.С. Шемановского"
			}
		},
		{
			"start_date": {
				"year": "1962",
				"month": "9",
				"day": "27"
			},
			"text": {
				"headline": "Первый газовый фонтан",
				"text": "<p>27 сентября 1962 года на Мамеевском мысу с глубины 2 200 метров забил первый газовый фонтан будущего Тазовского месторождения – первого газового месторождения на Тюменском Севере.</p>"
			},
			"media": {
				"url": "timeline/img/tzv-13.jpg",
				"credit": "Архив МВК им. И.С. Шемановского"
			}
		},
		{
			"start_date": {
				"year": "1963",
				"month": "7",
				"day": "16"
			},
			"text": {
				"headline": "Тазовская нефтегазоразведочная экспедиция",
				"text": "<p>16 июля 1963 года была создана Тазовская нефтегазоразведочная экспедиция. Начальником экспедиции назначен Василий Подшибякин.</p>"
			},
			"media": {
				"url": "timeline/img/tzv-14.jpg",
				"credit": "Тюменская область сегодня"
			}
		},
		{
			"start_date": {
				"year": "1963",
				"month": "8"
			},
			"display_date": "1963",
			"text": {
				"headline": "Cтроительство села Газ-Сале",
				"text": "<p>В 1963 году началось строительство поселка нефтегазоразведчиков – будущего села Газ-Сале. </p>"
			},
			"media": {
				"url": "timeline/img/tzv-15.jpg",
				"credit": "angi.ru"
			}
		},
		{
			"start_date": {
				"year": "1965",
				"month": "1",
				"day": "15"
			},
			"text": {
				"headline": "Политехническая общеобразовательная средняя школа",
				"text": "<p>15 января 1965 года в Тазовском открылась трудовая политехническая общеобразовательная средняя школа с производственным обучением, а Тазовская средняя школа-интернат была преобразована в восьмилетнюю школу-интернат.</p>"
			},
			"media": {
				"url": "timeline/img/tzv-16.jpg",
				"credit": "Отдел по делам архивов Администрации Тазовского района"
			}
		},
		{
			"start_date": {
				"year": "1965",
				"month": "10",
				"day": "16"
			},
			"text": {
				"headline": "Открыто Заполярное нефтегазоконденсатное месторождение",
				"text": "<p>16 октября 1965 года коллектив Тазовской нефтегазоразведочной экспедиции открыл Заполярное нефтегазоконденсатное месторождение. Всего на территории района в 60-90-е годы прошлого века открылось более 30 месторождений, в том числе такие гиганты, как Ямбургское нефтегазоконденсатное месторождение.</p>"
			},
			"media": {
				"url": "timeline/img/tzv-17.jpg",
				"credit": "angi.ru"
			}
		},
		{
			"start_date": {
				"year": "1966",
				"month": "9",
				"day": "1"
			},
			"text": {
				"headline": "Открылась Тазовская детская музыкальная школа",
				"text": "<p>1 сентября 1966 года открылась Тазовская детская музыкальная школа, в настоящее время – Тазовская детская школа искусств.</p>"
			}
		},
		{
			"start_date": {
				"year": "1968"
			},
			"text": {
				"headline": "Построен газопровод от Тазовского месторождения до райцентра",
				"text": "<p>В 1968 году построен газопровод протяженностью 27 км от Тазовского месторождения до райцентра. Годом позже сдан газопровод до села Газ-Сале, началась газификация населенных пунктов.</p>"
			}
		},
		{
			"start_date": {
				"year": "1975",
				"month": "2",
				"day": "28"
			},
			"text": {
				"headline": "Образован Газ-Салинский сельсовет",
				"text": "<p>28 февраля образован Газ-Салинский сельсовет с центром в поселке Газ-Сале.</p>"
			}
		},
		{
			"start_date": {
				"year": "1975",
				"month": "7",
				"day": "17"
			},
			"text": {
				"headline": "Телевизионная станция «Орбита-2»",
				"text": "<p>17 июля начала работу телевизионная станция «Орбита-2». В поселок Тазовский грузовыми самолетами доставлены первые 135 телевизоров.</p>"
			},
			"media": {
				"url": "timeline/img/tzv-18.jpg",
				"credit": ""
			}
		},
		{
			"start_date": {
				"year": "1980"
			},
			"text": {
				"headline": "Образован Тазовский объединенный авиаотряд",
				"text": "<p>Образован Тазовский объединенный авиаотряд в составе базового аэропорта с приписными аэропортами в селах и летным отрядом.</p>"
			},
			"media": {
				"url": "timeline/img/tzv-19.jpg",
				"credit": ""
			}
		},
		{
			"start_date": {
				"year": "1991",
				"month": "6",
				"day": "25"
			},
			"text": {
				"headline": "Появление телевидения",
				"text": "<p>25 июня 1991 года начала работу Тазовская телевизионная студия «Факт».</p>"
			}
		},
		{
			"start_date": {
				"year": "1991",
				"month": "7",
				"day": "17"
			},
			"text": {
				"headline": "Открытии детского и юношеского клуба",
				"text": "<p>17 июля 1991 года принято решение об открытии в Газ-Сале детского и юношеского клуба (в настоящее время – Газ-Салинский детско-юношеский центр).</p>"
			}
		},
		{
			"start_date": {
				"year": "1995",
				"month": "1",
				"day": "12"
			},
			"text": {
				"headline": "Сформировано районное представительное собрание",
				"text": "<p>12 января 1995 года впервые сформировано районное представительное собрание, ныне – дума Тазовского района</p>"
			}
		},
		{
			"start_date": {
				"year": "1996",
				"month": "10",
				"day": "7"
			},
			"text": {
				"headline": "Учрежден Государственный природный заповедник «Гыданский»",
				"text": "<p>7 октября 1996 года учрежден Государственный природный заповедник «Гыданский». </p>"
			},
			"media": {
				"url": "timeline/img/tzv-20.jpg",
				"credit": "Сообщество «Молодые экологи Тазовского района»"
			}
		},
		{
			"start_date": {
				"year": "2001",
				"month": "1",
				"day": "1"
			},
			"text": {
				"headline": "Родился первый ребенок XXI века",
				"text": "<p>1 января 2001 года в Антипаютинской тундре Тазовского района родился первый ребенок XXI века и третьего тысячелетия – Александр Вануйто. А в Находке незадолго до этого появился еще один новорожденный – Пудана Ядне, в переводе с ненецкого пудана значит «последний».</p>"
			}
		},
		{
			"start_date": {
				"year": "2005",
				"month": "5",
				"day": "9"
			},
			"text": {
				"headline": "Открыт памятник погибшим в годы Великой Отечественной войны воинам-тазовчанам",
				"text": "<p>9 мая 2005 года после реконструкции открыт памятник погибшим в годы Великой Отечественной войны воинам-тазовчанам. Впервые в истории района на площади у памятника приняли присягу работники ОВД.</p>"
			},
			"media": {
				"url": "timeline/img/tzv-21.jpg",
				"credit": "Советское Заполярье"
			}
		},
		{
			"start_date": {
				"year": "2005",
				"month": "7"
			},
			"display_date": "2005",
			"text": {
				"headline": "Школа-интернат",
				"text": "<p>В 2005 году в районе ввели в эксплуатацию здание школы-интерната на 270 мест.</p>"
			}
		},
		{
			"start_date": {
				"year": "2005",
				"month": "9"
			},
			"display_date": "2005",
			"text": {
				"headline": "Открыто здание районного краеведческого музея",
				"text": "<p>В 2005 году было открыто современное здание районного краеведческого музея. Сегодня его основной фонд составляет 1500 объектов. Наиболее широко в музее представлена этнографическая экспозиция. </p>"
			},
			"media": {
				"url": "timeline/img/tzv-22.jpg",
				"credit": "Советское Заполярье"
			}
		},
		{
			"start_date": {
				"year": "2006",
				"month": "10",
				"day": "10"
			},
			"text": {
				"headline": "Открыто родильное отделение Тазовской ЦРБ",
				"text": "<p>10 октября открыто родильное отделение Тазовской центральной районной больницы.</p>"
			},
			"media": {
				"url": "timeline/img/tzv-23.jpg",
				"credit": "Советское Заполярье"
			}
		},
		{
			"start_date": {
				"year": "2006",
				"month": "11"
			},
			"display_date": "2006",
			"text": {
				"headline": "Открыта трасса Тазовский – Новый Уренгой",
				"text": "<p>В 2006 году открыта трасса Тазовский – Новый Уренгой протяженностью 120 километров, связывающая район с Большой землей.</p>"
			},
			"media": {
				"url": "timeline/img/tzv-24.jpg",
				"credit": "Советское Заполярье"
			}
		},
		{
			"start_date": {
				"year": "2008"
			},
			"text": {
				"headline": "Открыто новое здание учебного корпуса Тазовской средней школы",
				"text": "<p>Открыто новое здание учебного корпуса Тазовской средней школы на 800 мест.</p>"
			},
			"media": {
				"url": "timeline/img/tzv-25.jpg",
				"credit": "Тазовская средняя общеобразовательная школа"
			}
		},
		{
			"start_date": {
				"year": "2010"
			},
			"text": {
				"headline": "Открылась новая районная поликлиника",
				"text": "<p>В Тазовском открылась новая районная поликлиника.</p>"
			},
			"media": {
				"url": "timeline/img/tzv-26.jpg",
				"credit": "Советское Заполярье"
			}
		},
		{
			"start_date": {
				"year": "2011"
			},
			"text": {
				"headline": "Ввод в эксплуатацию убойного пункта оленей",
				"text": "<p>Важным событием в сфере АПК стал ввод в эксплуатацию убойного пункта оленей в селе Антипаюта осенью 2011 года. </p>"
			},
			"media": {
				"url": "timeline/img/tzv-27.jpg",
				"credit": "Советское Заполярье"
			}
		},
		{
			"start_date": {
				"year": "2017",
				"month": "1"
			},
			"display_date": "Январь 2017",
			"text": {
				"headline": "На Тазовском лицензионном участке возобновилась разработка недр",
				"text": "<p>В 2017 году на Тазовском лицензионном участке возобновилась разработка недр. Компания «Газпромнефть-Развитие» планирует построить здесь 132 нефтяных и 10 газовых скважин, чтобы в 2021 году приступить к промышленной добыче углеводородов.</p>"
			},
			"media": {
				"url": "timeline/img/tzv-28.jpg",
				"credit": "Газпромнефть-Развитие"
			}
		},
		{
			"start_date": {
				"year": "2017",
				"month": "9"
			},
			"display_date": "Сентябрь 2017",
			"text": {
				"headline": "Открытие в Тазовском тепловой электростанции",
				"text": "<p>В сентябре 2017 года губернатора ЯНАО Дмитрий Кобылкин открыл в Тазовском тепловую электростанцию на 12 МВт, которую возвели всего за год. Станция заменила устаревшую ТЭЦ начала 80-х годов.</p>"
			},
			"media": {
				"url": "timeline/img/tzv-29.jpg",
				"credit": "Советское Заполярье"
			}
		},
		{
			"start_date": {
				"year": "2017",
				"month": "12"
			},
			"display_date": "Декабрь 2017",
			"text": {
				"headline": "Сдано рекордное количество жилья",
				"text": "<p>В 2017 году в Тазовском районе сдано рекордное количество жилья – около 30 тысяч квадратных метров, это 13 многоквартирных и 8 индивидуальных жилых домов. Свои жилищные условия улучшили более 500 семей района.</p>"
			},
			"media": {
				"url": "timeline/img/tzv-30.jpg",
				"credit": "Советское Заполярье"
			}
		},
		{
			"start_date": {
				"year": "2019",
				"month": "9"
			},
			"display_date": "Сентябрь 2019",
			"text": {
				"headline": "Российский инвестиционный форум",
				"text": "<p>На Российском инвестиционном форуме в сентябре 2019 года губернатор ЯНАО Дмитрий Артюхов и председатель правления компании «Газпром нефть» Александр Дюков заключили соглашение о социально-экономическом партнерстве. Компания взяла на себя обязательства развивать дорожную и энергетическую инфраструктуру Тазовского района.</p>"
			},
			"media": {
				"url": "https://www.youtube.com/watch?v=-bA9gyCnaEc",
				"credit": "Газпром нефть"
			}
		},
		{
			"start_date": {
				"year": "2019",
				"month": "10"
			},
			"display_date": "Октябрь 2019",
			"text": {
				"headline": "Фестиваль уличного искусства «Стенограффия»",
				"text": "<p>В Тазовском впервые прошел фестиваль уличного искусства «Стенограффия» – один из проектов программы социальных инвестиций компании «Газпром нефть». Холстом для художников стрит-арта стала стена спального корпуса школы-интерната.</p>"
			},
			"media": {
				"url": "timeline/img/tzv-32.jpg",
				"credit": "Газпромнефть-Развитие"
			}
		},
		{
			"start_date": {
				"year": "2019",
				"month": "11"
			},
			"display_date": "Ноябрь 2019",
			"text": {
				"headline": "Масштабное исследование окружающей среды",
				"text": "<p>На территории района началось масштабное исследование окружающей среды, организованное по инициативе компании «Газпромнефть-Развитие». Итогом первой экспедиции сотрудников Института экологии растений и животных Уральского отделения РАН стал экологический атлас территории, с описанием состояния флоры и фауны района. Подробнее узнать о проекте и посмотреть красочные фото дикой природы Арктики можно на сайте <a href='https://discovery-russia.ru/europe/russia/hrupkaja-krasota.html' target='_blank'>Discovery</a>.</p>"
			},
			"media": {
				"url": "timeline/img/tzv-33.jpg",
				"credit": "discovery-russia.ru"
			}
		},
		{
			"start_date": {
				"year": "2020",
				"month": "2"
			},
			"display_date": "Февраль 2020",
			"text": {
				"headline": "Турнир «Умножая таланты»",
				"text": "<p>В феврале 2020 года школьники Тазовского района стали победителями интеллектуального турнира «Умножая таланты», организованного в рамках программы социальных инвестиций «Родные города» компании «Газпром нефть».  В турнире тазовские ребята участвовали впервые.</p>"
			},
			"media": {
				"url": "timeline/img/tzv-34.jpg",
				"credit": "Газпромнефть-Развитие"
			}
		},
		{
			"start_date": {
				"year": "2020",
				"month": "3"
			},
			"display_date": "Март 2020",
			"text": {
				"headline": "Класс робототехники в детском саду «Олененок»",
				"text": "<p>Весной 2020 года в детском саду «Олененок» оборудован класс робототехники. Образовательный проект для дошкольников совместно с администрацией Тазовского района реализует компания «Газпромнефть-Развитие» в рамках программы социальных инвестиций «Родные города».</p>"
			},
			"media": {
				"url": "timeline/img/tzv-35.jpg",
				"credit": "Газпромнефть-Развитие"
			}
		},
		{
			"start_date": {
				"year": "2020",
				"month": "10",
				"day": "16"
			},
			"text": {
				"headline": "Открыт мост через реку Пур",
				"text": "<p>16 октября 2020 года открыт мост через реку Пур, который связал Пуровский, Тазовский и Красноселькупский районы с основной сетью региональных дорог и обеспечил их жителям круглогодичный проезд.</p>"
			},
			"media": {
				"url": "timeline/img/tzv-36.jpg",
				"credit": "znak.com"
			}
		},
		{
			"start_date": {
				"year": "2020",
				"month": "12"
			},
			"display_date": "Декабрь 2020",
			"text": {
				"headline": "«Человек года»",
				"text": "<p>Сотрудник Тазовского месторождения компании «Газпромнефть-Развитие» завоевал почетный титул Региональной премии Ямала «Человек года» в номинации «Экология». В марте 2020 года Афанасий Тэсида спас детеныша нерпы, найденного недалеко от промысла.</p>"
			},
			"media": {
				"url": "timeline/img/tzv-37.jpg",
				"credit": "Газпромнефть-Развитие"
			}
		},
		{
			"start_date": {
				"year": "2021"
			},
			"text": {
				"headline": "Начало промышленной разработки Тазовского месторождения.",
				"text": "<p>Начало промышленной разработки Тазовского месторождения.</p>"
			},
			"media": {
				"url": "timeline/img/tzv-38.jpg",
				"credit": "Правда УРФО"
			}
		}
	]
}		

window.timeline = new TL.Timeline('timeline', timeline_json, tl_options);